# Taps
tap 'caskroom/cask'
tap 'caskroom/eid'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/php'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'grep'

# Install Binaries
brew 'awscli'
brew 'git'
brew 'tree'
brew 'mackup'
brew 'mas'
brew 'node'
brew 'wget'

# Development
brew 'php'
brew 'php72-imagick'
brew 'mysql'

# Apps
#cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'gpgtools'
cask 'grammarly'
cask 'insomnia'
cask 'iterm2'
cask 'kdiff3'
cask 'now'
cask 'sequel-pro'
cask 'slack'
cask 'sublime-text'
cask 'zoomus'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac App Store apps
mas '1Password', id: 443987910
mas 'Byword', id: 420212497
mas 'Deckset', id: 847496013
mas 'Gapplin', id: 768053424
mas 'Giphy Capture', id: 668208984
mas 'Paw', id: 584653203
mas 'Sip', id: 507257563
mas 'Spark', id: 1176895641
mas 'The Unarchiver', id: 425424353
mas 'Things', id: 904280696
mas 'Tweetbot', id: 557168941
mas 'Unsplash Wallpapers', id: 1284863847
mas 'WhatsApp', id: 1147396723 
